Autodesk.Revit.DB.IIFCConfigurationUpgradeServer.PerformUpgrade(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.IFCConfigurationUpgradeData)
Performs IFC configuration upgrade on the document.
This method loads saved configurations and migrates them to the new parameter mapping template system.
document:
Revit document to upgrade
data:
Data container with upgrade information
Returns:
True if upgrade was performed successfully, false otherwise
Since:
2027

Autodesk.Revit.DB.IIFCConfigurationUpgradeServer
The interface used to perform IFC configuration upgrades.
Since:
2027